app/controllers/books_controller.rb

	def index
		#投稿機能
		@book = Book.new
		#一覧機能
		@books = Book.all
---
SELECT "books".* FROM "books"

	def create
		#ストロングパラメーターのため＠なし
		@book = Book.new(book_params)
		#bookをDBへ保存が成功したら
		if @book.save
			redirect_to book_path(@book.id), notice: "successfully"
		else
			@books = Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "new"], ["body", "book"], ["created_at", "2020-02-04 06:59:43.728508"], ["updated_at", "2020-02-04 06:59:43.728508"]]
SELECT "books".* FROM "books"